# Pandas - DataFrame and Series

Pandas is a powerful data manipulation library in Python, widely used for data-analysis and data cleaning. It provides two main data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axis. (rows and columns)

In [1]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\azim\appdata\roaming\python\python312\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\azim\appdata\roaming\python\python312\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\azim\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\azim\appdata\roaming\python\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\program files\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\azim\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
data = [1,2,3,4,5]

series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
## Create Series from dictionary (key becomes an index)
data = {'a':1, 'b':2, 'c':3}

dict_series = pd.Series(data)
dict_series

a    1
b    2
c    3
dtype: int64

In [ ]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
pd.Series(data=data, index=index)

a    10
b    20
c    30
dtype: int64

DataFrame

In [ ]:
## Create a DataFrame from a dictionary
data={
    'Name': ["Azim", "Alim", "Aziz"],
    'Age': [19, 19, 21],
    'City': ['Tashkent', 'Chicago', 'Samarkand']
}

df = pd.DataFrame(data=data)

print(df)
print(type(df))

   Name  Age       City
0  Azim   19   Tashkent
1  Alim   19    Chicago
2  Aziz   21  Samarkand
<class 'pandas.core.frame.DataFrame'>

In [9]:
## Create a DataFrame from a list of dictionaries

data=[
    {'Name': 'Azimjon', 'Age': 19, 'City': 'Tashkent'},
    {'Name': 'Bobir', 'Age': 20, 'City': 'New York'},
    {'Name': 'Aziz', 'Age': 21, 'City': 'Tashkent'}
]

df = pd.DataFrame(data=data)
df

      Name  Age      City
0  Azimjon   19  Tashkent
1    Bobir   20  New York
2     Aziz   21  Tashkent

In [11]:
type(df['Name'])

pandas.core.series.Series

In [14]:
df.loc[0][0]

C:\Users\Azim\AppData\Local\Temp\ipykernel_9544\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Azimjon'

In [ ]:
## Index-based access
df.iloc[0][0]

C:\Users\Azim\AppData\Local\Temp\ipykernel_9544\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Azimjon'

In [ ]:
## Accesing a specified element
df.at[0, 'Age']

np.int64(19)

In [23]:
df['Salary']=[10000, 4000, 3000]

In [25]:
df.drop('Salary', axis=1, inplace=True)

In [35]:
df['Age'] = df['Age'] + 1

df

      Name  Age      City
0  Azimjon   26  Tashkent
1    Bobir   27  New York
2     Aziz   28  Tashkent

In [33]:
#Describe the types of each column
print("Data types:\n", df.dtypes)

#Describe the dataframe
print("Statistical summary:\n", df.describe())

#Group by a column and perform an aggregation
grouped = df.groupby('Age')['Age'].mean()
print("Mean value by category:\n", grouped)

Data types:
 Name    object
Age      int64
City    object
dtype: object
Statistical summary:
         Age
count   3.0
mean   25.0
std     1.0
min    24.0
25%    24.5
50%    25.0
75%    25.5
max    26.0
Mean value by category:
 Age
24    24.0
25    25.0
26    26.0
Name: Age, dtype: float64

In [60]:
## fetch the first five rows
df.head(2)

   Product Category  Sales
0   iPhone        A    308
1  MacBook        B    616

In [61]:
df.tail(2)

   Product Category  Sales
1  MacBook        B    616
2    Redmi        C    181

In [62]:
df.describe()

            Sales
count    3.000000
mean   368.333333
std    223.688027
min    181.000000
25%    244.500000
50%    308.000000
75%    462.000000
max    616.000000

In [63]:
df.dtypes

Product     object
Category    object
Sales        int32
dtype: object

In [66]:
## Handling missing values
df.isnull().any()

Product     False
Category    False
Sales       False
dtype: bool

In [71]:
## Renaming columns
df = df.rename(columns={'Product':'Title'})
df

     Title Category  Sales
0   iPhone        A    308
1  MacBook        B    616
2    Redmi        C    181

In [74]:
## Change datatypes
df['new_value'] = df['Sales'].astype(float)

df

     Title Category  Sales  new_value
0   iPhone        A    308      308.0
1  MacBook        B    616      616.0
2    Redmi        C    181      181.0

Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randint(1, 101, size=(6, 4)), columns=['ID', 'A', 'B', 'C'])

df.set_index('ID', inplace=True)

In [4]:
df = pd.DataFrame(
    np.random.randint(1, 101, size=(3, 3)),  # random integers from 1 to 100
    columns=['A', 'B', 'C'],
    index=['X', 'Y', 'Z']
)

# Access the element at row 'Y' and column 'B'
value = df.loc['Y', 'B']

# Print the DataFrame and the value
print("DataFrame:")
print(df)
print("\nElement at row 'Y' and column 'B':", value)

DataFrame:
    A   B   C
X  84  18  39
Y  87   1  47
Z   1  66  73

Element at row 'Y' and column 'B': 1

Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [9]:
df = pd.DataFrame(
    np.random.randint(-100, 100, size=(5,3))
)

df['product_of_last_two_columns'] = df[1] * df[2]

df

    0   1   2  product_of_last_two_columns
0  68  79  28                         2212
1  44 -75 -33                         2475
2  57 -66  55                        -3630
3 -40  32  63                         2016
4  15  58 -32                        -1856

In [15]:
df = pd.DataFrame(
    np.random.randint(-100, 100, size=(4,3))
)

print(df)
print("column-wise sum\n", df.sum(axis=0))
print("row-wise sum\n", df.sum(axis=1))

    0   1   2
0  24 -45  -1
1  90 -83  58
2  99 -94   6
3   8  67  45
column-wise sum
 0    221
1   -155
2    108
dtype: int64
row-wise sum
 0    -22
1     65
2     11
3    120
dtype: int64

Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [22]:
df = pd.DataFrame(
    np.random.randint(-100, 100, size=(5, 3))
)

df.loc[1, 1] = np.nan
df.loc[2, 2] = np.nan
df.loc[4, 0] = np.nan

print("DF with nan:\n", df)

df.fillna(df.mean(), inplace=True)

print("DF with filled nan:\n", df)

DF with nan:
       0     1     2
0  57.0  45.0 -63.0
1 -14.0   NaN  38.0
2  67.0  83.0   NaN
3  37.0 -67.0 -55.0
4   NaN  77.0 -13.0
DF with filled nan:
        0     1      2
0  57.00  45.0 -63.00
1 -14.00  34.5  38.00
2  67.00  83.0 -23.25
3  37.00 -67.0 -55.00
4  36.75  77.0 -13.00

In [29]:
df = pd.DataFrame(
    np.random.randint(-100, 100, size=(5, 3))
)

df.loc[1, 1] = np.nan
df.loc[2, 2] = np.nan
df.loc[4, 0] = np.nan

print("DF with nan:\n", df)

df.dropna(how='any', inplace=True)

print("DF without nan:\n", df)

DF with nan:
       0     1      2
0   0.0  11.0   85.0
1  23.0   NaN   60.0
2  90.0 -96.0    NaN
3  31.0  98.0   31.0
4   NaN -56.0 -100.0
DF without nan:
       0     1     2
0   0.0  11.0  85.0
3  31.0  98.0  31.0

Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [44]:
df = pd.DataFrame({
    'Category': ['A', 'B', 'C'],
    'Value': np.random.randint(-10, 10, size=3)
})

print(df)

grouped = df.groupby('Category')['Value'].mean()

print(grouped)

  Category  Value
0        A      7
1        B      3
2        C      8
Category
A    7.0
B    3.0
C    8.0
Name: Value, dtype: float64

In [52]:
df = pd.DataFrame({
    'Product': ['iPhone', 'MacBook', 'Redmi'],
    'Category': ['A', 'B', 'C'],
    'Sales': np.random.randint(0, 1000, size=3)
})

print(df)

df.groupby('Category')['Sales'].sum()

   Product Category  Sales
0   iPhone        A    308
1  MacBook        B    616
2    Redmi        C    181

Category
A    308
B    616
C    181
Name: Sales, dtype: int32

Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [56]:
df1 = pd.DataFrame({
    'Sales': np.random.randint(100, 1000, size=5),
    'Product': ['iPhone', 'MacBook', 'iPad', 'Book', 'Samsung'],
    'Production_year': [2022, 2024, 2023, 1998, 2025]
})

print(df1)

df2 = pd.DataFrame({
    'Ranking': np.random.randint(0, 5, size=5),
    'Product': ['iPhone', 'MacBook', 'iPad', 'Book', 'Samsung'],
})

print(df2)

merged_df = pd.merge(df1, df2, on='Product')

print(merged_df)

   Sales  Product  Production_year
0    200   iPhone             2022
1    521  MacBook             2024
2    881     iPad             2023
3    363     Book             1998
4    809  Samsung             2025
   Ranking  Product
0        2   iPhone
1        3  MacBook
2        3     iPad
3        3     Book
4        1  Samsung
   Sales  Product  Production_year  Ranking
0    200   iPhone             2022        2
1    521  MacBook             2024        3
2    881     iPad             2023        3
3    363     Book             1998        3
4    809  Samsung             2025        1

In [57]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

df2 = pd.DataFrame({
    'C': [7, 8, 9],
    'D': [10, 11, 12]
})

# Concatenate along the rows (vertically)
concat_rows = pd.concat([df1, df2], axis=0, ignore_index=True)

# Concatenate along the columns (horizontally)
concat_columns = pd.concat([df1, df2], axis=1)

print("Concatenated along rows (vertically):\n", concat_rows)
print("\nConcatenated along columns (horizontally):\n", concat_columns)

Concatenated along rows (vertically):
      A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
3  NaN  NaN  7.0  10.0
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

Concatenated along columns (horizontally):
    A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [ ]:
#TODO

Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [ ]:
#TODO

Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [ ]:
#TODO

Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [ ]:
#TODO

Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [ ]:
#TODO